ApplyingAccountScopingProblems.org
* Pages 80 - 82
 + Problem:   *spec/controllers/subscribem/accounts\_controller\_spec.rb*, lines 13-14, contain the fix for the test error.
   #+BEGIN_EXAMPLE
  ActionController::RoutingError:
    No route matches {:account=>{:name=>"First Account"},
		      :controller=>"subscribem/accounts",
		      :action=>"create"}
    
   #+END_EXAMPLE

   #+BEGIN_SRC Ruby
  post :create, :account => { :name => "First Account" },
	  and_return(account)
   #+END_SRC
	should be:
   #+BEGIN_SRC Ruby
	  post :create, :account => { :name => "First Account" }
   #+END_SRC
 + Problem: After making this change problem described at top of Page 82 with:
   #+BEGIN_EXAMPLE
   Failure/Error: post :create, :account => { :name => "First Account" },
   RuntimeError:
     Called id for nil, which would mistakenly be 4 --
     if you really wanted the id of nil, use object_id   
   #+END_EXAMPLE
   does not occurr, making this error report and the paragraph that follows confusing.

   My experience parallels the next reported error and it's related fix, the modification of AccountsController::Create.



	  
  
  
