ApplyingAccountScopingProblems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>ApplyingAccountScopingProblems</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-05 08:43:52 EST"/>
<meta name="author" content="Richard Lloyd"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">ApplyingAccountScopingProblems</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Pages 80 - 82 </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Pages 80 - 82 </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
Problem:   <b>spec/controllers/subscribem/accounts_controller_spec.rb</b>, lines 13-14, contain the fix for the test error.



<pre class="example">ActionController::RoutingError:
  No route matches {:account=&gt;{:name=&gt;"First Account"},
                    :controller=&gt;"subscribem/accounts",
                    :action=&gt;"create"}
  
</pre>





<pre class="example">post :create, :account =&gt; { :name =&gt; "First Account" },
        and_return(account)
</pre>



<p>
should be:
</p>


<pre class="example">post :create, :account =&gt; { :name =&gt; "First Account" }
</pre>



</li>
<li>
Problem: After making this change problem described at top of Page 82 with:



<pre class="example">Failure/Error: post :create, :account =&gt; { :name =&gt; "First Account" },
RuntimeError:
  Called id for nil, which would mistakenly be 4 --
  if you really wanted the id of nil, use object_id   
</pre>



<p>
does not occurr, making this error report and the paragraph that follows confusing.
</p>
<p>
My experience parallels the next reported error and it's related fix, the modification of AccountsController::Create.
</p>





</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Richard Lloyd
<a href="mailto:richard.t.lloyd@gmail.com">&lt;richard.t.lloyd@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2013-11-05 08:43:52 EST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
